____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
P_str (InputLayer)               (None, None, 25)      0                                            
____________________________________________________________________________________________________
Q_str (InputLayer)               (None, None, 25)      0                                            
____________________________________________________________________________________________________
P_vecs (InputLayer)              (None, None, 300)     0                                            
____________________________________________________________________________________________________
time_distributed_1 (TimeDistribu (None, None, 90)      30285       P_str[0][0]                      
                                                                   Q_str[0][0]                      
____________________________________________________________________________________________________
Q_vecs (InputLayer)              (None, None, 300)     0                                            
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, None, 390)     0           P_vecs[0][0]                     
                                                                   time_distributed_1[0][0]         
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, None, 390)     0           Q_vecs[0][0]                     
                                                                   time_distributed_1[1][0]         
____________________________________________________________________________________________________
masking_1 (Masking)              (None, None, 390)     0           concatenate_1[0][0]              
____________________________________________________________________________________________________
masking_2 (Masking)              (None, None, 390)     0           concatenate_2[0][0]              
____________________________________________________________________________________________________
bidirectional_2 (Bidirectional)  (None, None, 90)      117720      masking_1[0][0]                  
____________________________________________________________________________________________________
bidirectional_5 (Bidirectional)  (None, None, 90)      117720      masking_2[0][0]                  
____________________________________________________________________________________________________
bidirectional_3 (Bidirectional)  (None, None, 90)      36720       bidirectional_2[0][0]            
____________________________________________________________________________________________________
bidirectional_6 (Bidirectional)  (None, None, 90)      36720       bidirectional_5[0][0]            
____________________________________________________________________________________________________
bidirectional_4 (Bidirectional)  (None, None, 90)      36720       bidirectional_3[0][0]            
____________________________________________________________________________________________________
bidirectional_7 (Bidirectional)  (None, None, 90)      36720       bidirectional_6[0][0]            
____________________________________________________________________________________________________
uP (VariationalDropout)          (None, None, 90)      0           bidirectional_4[0][0]            
____________________________________________________________________________________________________
uQ (VariationalDropout)          (None, None, 90)      0           bidirectional_7[0][0]            
____________________________________________________________________________________________________
WQ_u (SharedWeightLayer)         (90, 45)              4050                                         
____________________________________________________________________________________________________
WP_v (SharedWeightLayer)         (45, 45)              2025                                         
____________________________________________________________________________________________________
WP_u (SharedWeightLayer)         (90, 45)              4050                                         
____________________________________________________________________________________________________
v (SharedWeightLayer)            (45, 1)               45                                           
____________________________________________________________________________________________________
W_g1 (SharedWeightLayer)         (180, 180)            32400                                        
____________________________________________________________________________________________________
question_attn_gru_1 (QuestionAtt (None, None, 45)      30510       uP[0][0]                         
                                                                   uQ[0][0]                         
                                                                   WQ_u[0][0]                       
                                                                   WP_v[0][0]                       
                                                                   WP_u[0][0]                       
                                                                   v[0][0]                          
                                                                   W_g1[0][0]                       
____________________________________________________________________________________________________
vP (VariationalDropout)          (None, None, 45)      0           question_attn_gru_1[0][0]        
____________________________________________________________________________________________________
WPP_v (SharedWeightLayer)        (45, 45)              2025                                         
____________________________________________________________________________________________________
W_g2 (SharedWeightLayer)         (90, 90)              8100                                         
____________________________________________________________________________________________________
bidirectional_8 (Bidirectional)  (None, None, 90)      36720       vP[0][0]                         
                                                                   vP[0][0]                         
                                                                   WP_v[0][0]                       
                                                                   WPP_v[0][0]                      
                                                                   v[0][0]                          
                                                                   W_g2[0][0]                       
____________________________________________________________________________________________________
WQ_v (SharedWeightLayer)         (90, 45)              4050                                         
____________________________________________________________________________________________________
VQ_r (SharedWeightLayer)         (45, 45)              2025                                         
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 390)           0           concatenate_1[0][0]              
____________________________________________________________________________________________________
hP (VariationalDropout)          (None, None, 90)      0           bidirectional_8[0][0]            
____________________________________________________________________________________________________
question_pooling_1 (QuestionPool (None, 90)            0           uQ[0][0]                         
                                                                   WQ_u[0][0]                       
                                                                   WQ_v[0][0]                       
                                                                   v[0][0]                          
                                                                   VQ_r[0][0]                       
____________________________________________________________________________________________________
fake_input (RepeatVector)        (None, 2, 390)        0           global_max_pooling1d_1[0][0]     
____________________________________________________________________________________________________
bidirectional_9 (Bidirectional)  (None, None, 90)      36720       hP[0][0]                         
____________________________________________________________________________________________________
WP_h (SharedWeightLayer)         (90, 45)              4050                                         
____________________________________________________________________________________________________
Wa_h (SharedWeightLayer)         (90, 45)              4050                                         
____________________________________________________________________________________________________
rQ (Dropout)                     (None, 90)            0           question_pooling_1[0][0]         
____________________________________________________________________________________________________
ps (PointerGRU)                  (None, 2, None)       48870       fake_input[0][0]                 
                                                                   bidirectional_9[0][0]            
                                                                   WP_h[0][0]                       
                                                                   Wa_h[0][0]                       
                                                                   v[0][0]                          
                                                                   rQ[0][0]                         
____________________________________________________________________________________________________
answer_start (Slice)             (None, None)          0           ps[0][0]                         
____________________________________________________________________________________________________
answer_end (Slice)               (None, None)          0           ps[0][0]                         
====================================================================================================
Total params: 632,295
Trainable params: 632,295
Non-trainable params: 0
____________________________________________________________________________________________________